app/Models/ModelKasMasjid.php

SELECT *
FROM `tbl_kas_masjid`
---
    public function AllData()
    {
        return $this->db->table('tbl_kas_masjid')
            ->get()->getResultArray();

SELECT *
FROM `tbl_kas_masjid`
WHERE `status` = 'In'
---
    public function AllDataKasMasuk()
    {
        return $this->db->table('tbl_kas_masjid')
            ->where('status', 'In')
            ->get()->getResultArray();

SELECT *
FROM `tbl_kas_masjid`
WHERE `status` = 'Keluar'
---
    public function AllDataKasKeluar()
    {
        return $this->db->table('tbl_kas_masjid')
            ->where('status', 'Keluar')
            ->get()->getResultArray();

INSERT INTO `tbl_kas_masjid` (`tanggal`, `ket`, `kas_masuk`, `kas_keluar`, `status`) VALUES ('2024-02-10', 'asdasd', '1999', 0, 'Masuk')
---
    public function InsertData($data)
    {
        $this->db->table('tbl_kas_masjid')->insert($data);