app/Models/ModelKasSosial.php

    public function AllData()
    {
        return $this->db->table('tbl_kas_sosial')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kas_sosial`