app/Views/v_template_admin.php

SELECT *
FROM `tbl_setting`
---
<body class="hold-transition sidebar-mini">
    <?php
    $db = \Config\Database::connect();
    $web = $db->table('tbl_setting')->get()->getRowArray();